#include<iostream>
#define MOD 1000000000
using namespace std;
long long d[101][10];

int main(){
    int n; 
    cin>>n;

  // 1 2 3 4 5 6 7 8 9
  // 10 11 / 21 23 / 32 34 / 43 45 / ... / 78 89 / 98
  // ...
 
 //9로 끝나는 것 / 0으로 끝나는 것 -> 1개만 만들게됨
 //그외 -> 2개씩 만듦
//1로 끝나는 것 -> 0을 만들게됨
//8로 끝나는 것 -> 9를 만들게됨
  
  //=>끝자리별로 나누어 저장
    d[1][0]=0; 
    d[1][1]=1;
    d[1][2]=1;
    d[1][3]=1;
    d[1][4]=1;
    d[1][5]=1;
    d[1][6]=1;
    d[1][7]=1;
    d[1][8]=1;
    d[1][9]=1;

for(int i=2;i<=n; i++){
d[i][0]=           d[i-1][1] %MOD; 
d[i][1]=(d[i-1][0]+d[i-1][2]) %MOD;
d[i][2]=(d[i-1][1]+d[i-1][3]) %MOD;
d[i][3]=(d[i-1][2]+d[i-1][4]) %MOD;
d[i][4]=(d[i-1][3]+d[i-1][5]) %MOD;
d[i][5]=(d[i-1][4]+d[i-1][6]) %MOD;
d[i][6]=(d[i-1][5]+d[i-1][7]) %MOD;
d[i][7]=(d[i-1][6]+d[i-1][8]) %MOD;
d[i][8]=(d[i-1][7]+d[i-1][9]) %MOD;
d[i][9]= d[i-1][8] %MOD;
}
cout<<(d[n][0]+d[n][1]+d[n][2]+d[n][3]+d[n][4]+d[n][5]+d[n][6]+d[n][7]+d[n][8]+d[n][9])%MOD;
    return 0;
}
